# Определить переменные всех 4 базовых типов и вывести их на экран

my_int = 21
print(my_int)

my_float = 21.5
print(my_float)

my_str = "asdfghjkl"
print(my_str)

my_bool = True
print(my_bool)
